In [0]:
import pandas as pd
import numpy as np

# Pandas 기초  
Pandas에서는 데이터 타입을 크게 Series와 DataFrame으로 두가지로 나뉘어서 다루고 있다.

## Series  
series 라는 것은 pandas의 1차원적인 데이터 타입을 말한다

In [124]:
import pandas as pd
import numpy as np

series = pd.Series([1, 3, 5, np.nan, 7, 9])
series

0    1.0
1    3.0
2    5.0
3    NaN
4    7.0
5    9.0
dtype: float64

결과 값 : 
0 , 1 , 2 , 3 , 4 , 5 : 인덱스 레이블
1.0 , 3.0 , 5.0 , nan(결측값) , 7.0 , 9.0 : 데이터(값)
dtype : 데이터 형식(밑에서 자세히 다룰것)

# 데이터 확인

In [41]:
#데이터 확인
print(series.index) #index 개수
print(series.values) # 값
print(type(series)) # 데이터형 확인

RangeIndex(start=0, stop=6, step=1)
[ 1.  3.  5. nan  7.  9.]
<class 'pandas.core.series.Series'>

In [42]:
# series 내의 원소 개수를 계산 방법( len , size , shape ,count )
print(len(series))
print(series.size)
print(series.shape)
print(series.count()) # 누락되지 않는 값의 개수를 반환 (결측치 (nan) 반환 하지않음)

6
6
(6,)
5

# 결측값(NaN) 처리

In [43]:
# 결측값(nan) 확인 
print(series.isnull())
# 결측값 개수
print( '결측값 개수 : ' , series.isna().sum())

0    False
1    False
2    False
3     True
4    False
5    False
dtype: bool
결측값 개수 :  1

In [128]:
# 모든 결측값을 삭제
drop = series.dropna()
drop

0    1.0
1    3.0
2    5.0
4    7.0
5    9.0
dtype: float64

In [48]:
# 모든 결측값을 한번에 특정값을 변경
series = series.fillna(0) # 결측값을 0으로 변경
series

0    1.0
1    3.0
2    5.0
3    0.0
4    7.0
5    9.0
dtype: float64

# 산술 연산자

In [54]:
print('덧셈 : ')
print(series + 3 ) # 더하기
print('뺄셈 : ')
print(series - 3 ) # 뺴기
print('곱셈 : ')
print(series * 4 ) # 곱하기
print('나눗셈 : ')
print(series / 2) # 나누기

덧셈 :
0     4.0
1     6.0
2     8.0
3     3.0
4    10.0
5    12.0
dtype: float64
뺄셈 :
0   -2.0
1    0.0
2    2.0
3   -3.0
4    4.0
5    6.0
dtype: float64
곱셈 :
0     4.0
1    12.0
2    20.0
3     0.0
4    28.0
5    36.0
dtype: float64
나눗셈 :
0    0.5
1    1.5
2    2.5
3    0.0
4    3.5
5    4.5
dtype: float64

# 비교 연산자

In [53]:
# 비교
print(' series > 3.0 : ')
print(series[series > 3.0])
print(' series < 3.0 : ') 
print(series[series < 3.0])
print(' series == 3.0 : ')
print(series[series == 3.0])

 series > 3.0 :
2    5.0
4    7.0
5    9.0
dtype: float64
 series < 3.0 :
0    1.0
3    0.0
dtype: float64
 series == 3.0 :
1    3.0
dtype: float64

In [0]:
# Series에서 slice 하면 true 값들만 반환
series[series > 3.0]

2    5.0
4    7.0
5    9.0
dtype: float64

# 기초통계

In [13]:
# 기초적인 요약 통계 방밥 (min , max , mean , median , std , sum)
print(series.min())
print(series.max())
print(series.mean())
print(series.median())
print(series.std())
print(series.sum())

1.0
9.0
5.0
5.0
3.1622776601683795
25.0

min : 최소값
max : 최대값
mean : 평균
median : 중위수
std : 표준편차
sum : 합

In [14]:
# 기초 통게를 한번에 확인하는 방법 
series.describe()
# 25% : 제 1사분위수 
# 50% : 제 2사분위수
# 75% : 제 3사분위수

count    5.000000
mean     5.000000
std      3.162278
min      1.000000
25%      3.000000
50%      5.000000
75%      7.000000
max      9.000000
dtype: float64

In [35]:
# 모든 결측값을 제거
series = pd.Series([1, 3, 5, np.nan, 7, 9])
series.dropna() # 결측값을 제거함

0    1.0
1    3.0
2    5.0
4    7.0
5    9.0
dtype: float64

## DataFrame
우리가 Excel에서 보듯이 2차원적인 데이터를 저장된 형태.  
Series가 모이면 DataFrame이라고 생각하면 된다.

# 데이터 만들기

In [8]:
import pandas as pd
# 데이터 입력 
data = [["lee", 12 , 154, 60, "F"],
        ["hoo" , 43 , 170, 45 , "M"],
        ["kim" , 51 , 165 , 55 , "F"],
        ["hong" , 54 , 189 , 78 , "F"],
        ["jin" , 26, 195 , 60 , 'M']]  #female = F , male = M 
data

[['lee', 12, 154, 60, 'F'],
 ['hoo', 43, 170, 45, 'M'],
 ['kim', 51, 165, 55, 'F'],
 ['hong', 54, 189, 78, 'F'],
 ['jin', 26, 195, 60, 'M']]

In [9]:
example = pd.DataFrame(data)
# dataframe 만들때 columns index을 설정하지 않으면 기본값이 0 부터 시작한다 
example

      0   1    2   3  4
0   lee  12  154  60  F
1   hoo  43  170  45  M
2   kim  51  165  55  F
3  hong  54  189  78  F
4   jin  26  195  60  M

In [12]:
df = pd.DataFrame(data, columns=["Name", "Age", "Height", "Weight", 'Sex'],
                          index=["one", "two", "three", "four", "five"])
df

       Name  Age  Height  Weight Sex
one     lee   12     154      60   F
two     hoo   43     170      45   M
three   kim   51     165      55   F
four   hong   54     189      78   F
five    jin   26     195      60   M

In [13]:
# 데이터 확인
print('열 : '  ,df.columns)
print('인덱스 : '  ,df.index)
print('값(value) ') 
print(df.values)

열 :  Index(['Name', 'Age', 'Height', 'Weight', 'Sex'], dtype='object')
인덱스 :  Index(['one', 'two', 'three', 'four', 'five'], dtype='object')
값(value)
[['lee' 12 154 60 'F']
 ['hoo' 43 170 45 'M']
 ['kim' 51 165 55 'F']
 ['hong' 54 189 78 'F']
 ['jin' 26 195 60 'M']]

In [14]:
# 데이터 형식 확인
df.dtypes

Name      object
Age        int64
Height     int64
Weight     int64
Sex       object
dtype: object

# 열 추가 , 삭제

In [16]:
# add라는 열에 0부터 4까지의 값을 추가 
import numpy as np
df["add"] = np.arange(5)
df

       Name  Age  Height  Weight Sex  add
one     lee   12     154      60   F    0
two     hoo   43     170      45   M    1
three   kim   51     165      55   F    2
four   hong   54     189      78   F    3
five    jin   26     195      60   M    4

In [17]:
# series를 추가하기
df['add2'] = pd.Series([ 3 , 5 , 1 ], index = ["two" , 'four', 'five'])
df

       Name  Age  Height  Weight Sex  add  add2
one     lee   12     154      60   F    0   NaN
two     hoo   43     170      45   M    1   3.0
three   kim   51     165      55   F    2   NaN
four   hong   54     189      78   F    3   5.0
five    jin   26     195      60   M    4   1.0

In [18]:
# 열 삭제 
del df['add']
df

       Name  Age  Height  Weight Sex  add2
one     lee   12     154      60   F   NaN
two     hoo   43     170      45   M   3.0
three   kim   51     165      55   F   NaN
four   hong   54     189      78   F   5.0
five    jin   26     195      60   M   1.0

# 데이터 선택 조작

In [19]:
# 인덱스 0 ,1, 2, 3, 4 에서 2부터 4번까지 선택해서 출력
df[2:4]

       Name  Age  Height  Weight Sex  add2
three   kim   51     165      55   F   NaN
four   hong   54     189      78   F   5.0

In [20]:
# 인덱스 0 , 1, 2, 3, 4 에서 마지막 하나만 빼고 출력
df[:-1]

       Name  Age  Height  Weight Sex  add2
one     lee   12     154      60   F   NaN
two     hoo   43     170      45   M   3.0
three   kim   51     165      55   F   NaN
four   hong   54     189      78   F   5.0

In [21]:
# loc , iloc 함수 사용
df.loc['three'] # 출력 형태는 series

Name      kim
Age        51
Height    165
Weight     55
Sex         F
add2      NaN
Name: three, dtype: object

In [22]:
# 지정가능함 
df.loc['one':'three']

      Name  Age  Height  Weight Sex  add2
one    lee   12     154      60   F   NaN
two    hoo   43     170      45   M   3.0
three  kim   51     165      55   F   NaN

In [23]:
# 지정가능함 
df.loc['one':'three' , 'Sex'] # 인덱스 one - three 까지 성별만 출력

one      F
two      M
three    F
Name: Sex, dtype: object

In [24]:
df.loc['one' : 'two' , 'Age': 'Weight'] # 인덱스 one - two 까지 열은 age - weight 까지 출력

     Age  Height  Weight
one   12     154      60
two   43     170      45

In [25]:
# iloc 
# 인덱스 번호를 사용함
df.iloc[3] # 4번째 열인 hong 에 대한 정보 출력

Name      hong
Age         54
Height     189
Weight      78
Sex          F
add2         5
Name: four, dtype: object

In [26]:
df.iloc[2:4] # 인덱스가 2~4 까지 정보를 출력

       Name  Age  Height  Weight Sex  add2
three   kim   51     165      55   F   NaN
four   hong   54     189      78   F   5.0

In [27]:
df.iloc[1 , 3] # 인덱스가 1이고 열이 3인 값 출력

45

In [28]:
df.iloc[1, 3:6] #인덱스가 1이고 열이 3~6까지 변수를 출력함

Weight    45
Sex        M
add2       3
Name: two, dtype: object

# 결측값(NaN) 처리

In [29]:
# 결측값이 있는지 확인
df.isnull()

        Name    Age  Height  Weight    Sex   add2
one    False  False   False   False  False   True
two    False  False   False   False  False  False
three  False  False   False   False  False   True
four   False  False   False   False  False  False
five   False  False   False   False  False  False

In [30]:
# 결측값이 있는 행을 삭제
dropna = df.dropna()
dropna

      Name  Age  Height  Weight Sex  add2
two    hoo   43     170      45   M   3.0
four  hong   54     189      78   F   5.0
five   jin   26     195      60   M   1.0

In [31]:
# 결측값에 value 정해서 넣기
df = df.fillna(value = 0.1)
df

       Name  Age  Height  Weight Sex  add2
one     lee   12     154      60   F   0.1
two     hoo   43     170      45   M   3.0
three   kim   51     165      55   F   0.1
four   hong   54     189      78   F   5.0
five    jin   26     195      60   M   1.0

# 기초 통계

In [32]:
# 위에 데이터에서 데이터 형이 int 를 선택하기 
df = df.loc[:,['Age', 'Height' , 'Weight', 'add2']]
df

       Age  Height  Weight  add2
one     12     154      60   0.1
two     43     170      45   3.0
three   51     165      55   0.1
four    54     189      78   5.0
five    26     195      60   1.0

In [35]:
df.sum(axis=0) # axis = 0 , 행의 합

Age       186.0
Height    873.0
Weight    298.0
add2        9.2
dtype: float64

In [36]:
df.sum(axis=1) # axis = 1 열의 합

one      226.1
two      261.0
three    271.1
four     326.0
five     282.0
dtype: float64

In [39]:
print(df.min()) # axis을 지정하지 않으면 기본값 0이 들어가기 때문에 행을 기준이 계산이 됨 
print(df.max())
print(df.mean())
print(df.median())
print(df.std())
print(df.sum())

Age        12.0
Height    154.0
Weight     45.0
add2        0.1
dtype: float64
Age        54.0
Height    195.0
Weight     78.0
add2        5.0
dtype: float64
Age        37.20
Height    174.60
Weight     59.60
add2        1.84
dtype: float64
Age        43.0
Height    170.0
Weight     60.0
add2        1.0
dtype: float64
Age       17.796067
Height    17.038192
Weight    11.970798
add2       2.126735
dtype: float64
Age       186.0
Height    873.0
Weight    298.0
add2        9.2
dtype: float64

In [40]:
# 기초 통계 한번에 보기
df.describe()

             Age      Height     Weight      add2
count   5.000000    5.000000   5.000000  5.000000
mean   37.200000  174.600000  59.600000  1.840000
std    17.796067   17.038192  11.970798  2.126735
min    12.000000  154.000000  45.000000  0.100000
25%    26.000000  165.000000  55.000000  0.100000
50%    43.000000  170.000000  60.000000  1.000000
75%    51.000000  189.000000  60.000000  3.000000
max    54.000000  195.000000  78.000000  5.000000

# 추가 적으로 공분산 , 상관계수

In [45]:
print(df.cov()) # 공분산 ( 확률변수의 상관정도를 나타내는 값이다.)

            Age   Height   Weight    add2
Age     316.700   93.350   36.600  22.265
Height   93.350  290.300   94.050  18.895
Weight   36.600   94.050  143.300  12.045
add2     22.265   18.895   12.045   4.523

In [43]:
print(df.corr()) # 상관계수 (두 변수간 상관관계을 개수로 나타낸 것이다.)

             Age    Height    Weight      add2
Age     1.000000  0.307870  0.171804  0.588282
Height  0.307870  1.000000  0.461118  0.521447
Weight  0.171804  0.461118  1.000000  0.473119
add2    0.588282  0.521447  0.473119  1.000000